
// let a = prompt("Введите сторону квадрата")
// alert("Периметр квадрата равен : " + a*4)


// let a = prompt("Введите сторону квадрата : ")
// alert("Площадь квадрата равна : " + a**2)


// let a = prompt("Введите сторону a : ")
// let b = prompt("Введите сторону b : ")
// alert("Площадь прямоугольника равна : " + a*b + "\n Его периметр равен : " + 2*(1*a+1*b))


// let d = prompt("Введите диаметр : ")
// let L = 1*d * 3.14
// alert("Длина круга равна : " + L)


// let a = prompt("Введите длину ребра куба")
// alert("Обьем куба равен : " + (1*a)**3 + "\nПлощадь его поверхности равна : " + 6*(1*a)**2)


// let a = prompt("Введите длину ребра a : ")
// let b = prompt("Введите длину ребра b : ")
// let c = prompt("Введите длину ребра c : ")
// let V = 1*(a * b * c)
// let S = 2*(a*b + b*c + a*c)
// alert("Обьем прямоугольного паралелепипеда равен : " + V + "\nА его площадь равна : " + S)


// let R = prompt("Введите радиус окружности : ")
// let L = 2*3.14*R
// let S = 3.14*R**2
// alert("Длина окружности равна : " + L + "\nПлощадь равна : " + S)


// let a = prompt("Введите число a : ")
// let b = prompt("Введите число b : ")
// let C = (1*a+1*b)/2
// alert("Среднее арифметическое этих числе равно : " + C)


// let a = prompt("Введите число a : ")
// let b = prompt("Введите число b : ")
// let result = Math.sqrt(1*a+1*b)
// alert(result)


// let a = prompt("Введите число a : ")
// let b = prompt("Введите число b : ")
// alert("Их сумма равна : "+ (1*a + 1*b) + "\nИх разность равна : " + 1*(a-b) + "\nИх произвидение равно : " + a*b )



// let a = prompt("Введите первый катет : ")
// let b = prompt("Введите второй катет : ")
// let abc = (1*a)**2 + (1*b)**2
// let c = Math.sqrt(abc)
// alert("Гипотенуза равна : " + c + "\nПериметр равен : " + (1*a)+(1*b)+c)


// let L = prompt("Введите длину окружности : ")
// let R = 1*L/2
// let S = R**2*3.14
// alert(R + "\n" + S)


